<script setup lang="ts">
</script>
<template>
  <div>
    <div>
        НАЗВАНИЕ
	        Brick's Man - это своего рода бренд, происходящий от псевдонима.

        СИНОПСИС
            Я программист. В данный момент я сфокусирован на фронтенд-разработке, UI/UX, самосовершенствовании и развитии как в хард, так и софт скиллах.

        ОБРАЗОВАНИЕ
            2014-2019: ККМТ. Я окончил колледж по специальности ракетостроение.
            2019-2020: МГОТУ. Неоконченное высшее образование на факультете робототехники.
            2021-н.в.: Школа 21. В сентябре 2021 я поступил в российский филиал французской Школы 42 в Москве.

        ОПЫТ
            2020-2021: Преподаватель индивидуальных уроков в онлайн-школе программирования 'Hello World'.
            2021-2022: Преподаватель программирования в группах в школе 'Алгоритмика'.
            2022-н.в.: Код-ревьюер по фронтенду в Яндекс Практикуме.

        HARDSKILLS
            - Frontend: HTML, CSS (Sass / SCSS), JavaScript, jQuery, React JS.
            - Дополнительно: Python, C, SQLite.
            - Софт: Git, NPM, Linux / MacOS, UNIX Shell / CMD, VirtualBOX.
            - Уверенные знания в дизайне, UI/UX и графическом ПО (Photoshop, Illustrator, Xd, Figma).
            - В качестве бонуса могу добавить навык слепой печати. :)

        SOFTSKILLS
            - Английский уровня B1 (Intermediate).
            - Легко нахожу общий язык как с коллегами или наставниками, так и клиентами.
            - Благодаря опыту преподавания доношу мысли и идеи в доступной и понятной форме.
            - Для меня одинаково комфортно работать в одиночку и в команде.
            - Дедлайны меня не пугают.
            - В работе я проявляю инициативу и амбиции.
    </div>
  </div>
</template>
<style scoped>
</style>